In [1]:
import pandas as pd

In [5]:
left_df = pd.read_csv('temp_original.csv')
right_df = pd.read_csv('temp_imcomepc.csv')

In [6]:
left_df.head()

                                 MSA  year
0                          Akron, OH  2018
1        Albany-Schenectady-Troy, NY  2018
2  Allentown-Bethlehem-Easton, PA-NJ  2018
3                        Altoona, PA  2018
4       Anaheim-Santa Ana-Irvine, CA  2018

In [8]:
right_df.head()

                           MSA  year  income_pc
0                  Abilene, TX  2018      44039
1                    Akron, OH  2018      49770
2                   Albany, GA  2018      36889
3           Albany-Lebanon, OR  2018      42811
4  Albany-Schenectady-Troy, NY  2018      57743

In [10]:
new_df = pd.merge(left_df, right_df,  how='left', on=['MSA','year'])

In [14]:
new_df.head(15)

                                     MSA  year  income_pc
0                              Akron, OH  2018    49770.0
1            Albany-Schenectady-Troy, NY  2018    57743.0
2      Allentown-Bethlehem-Easton, PA-NJ  2018    53518.0
3                            Altoona, PA  2018    46236.0
4           Anaheim-Santa Ana-Irvine, CA  2018        NaN
5                          Ann Arbor, MI  2018    58667.0
6                    Anniston-Oxford, AL  2018    36482.0
7                           Appleton, WI  2018    50951.0
8                          Asheville, NC  2018    45540.0
9   Atlanta-Sandy Springs-Alpharetta, GA  2018    53354.0
10           Atlantic City-Hammonton, NJ  2018    48110.0
11                    Auburn-Opelika, AL  2018    38184.0
12        Augusta-Richmond County, GA-SC  2018    41738.0
13      Austin-Round Rock-Georgetown, TX  2018    60764.0
14                       Bakersfield, CA  2018    38079.0

In [12]:
new_df.shape[0]

46247

In [13]:
left_df.shape[0]

46247

In [15]:
new_df.to_csv('left_joined_income_pc.csv')